cf/DataProcessors/InteractiveExportChange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>InteractiveExportChange</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportVariant</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllDocumentsFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLinkerAllDocuments</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScriptFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalRegistrationScriptSite</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScriptFilterPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScriptParametersAdditions</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ViewCurrentSettings</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComposerAllDocumentsFilter</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalRegistration</Name>
					<Comment>Additional registration table</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressOfFormStore</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/DataProcessors/InteractiveExportChange/Forms/SettingsContentEditing/Ext/Form/Module.bsl
#Region FormEventsHandlers
//

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then 
		// Return if the form for analysis is received.
		Return;
	EndIf;
	
	FillPropertyValues(Object, Parameters.Object , , "ComposerAllDocumentsFilter, AdditionalRegistration, AdditionalRegistrationScriptSite");
	For Each String IN Parameters.Object.AdditionalRegistration Do
		FillPropertyValues(Object.AdditionalRegistration.Add(), String);
	EndDo;
	For Each String IN Parameters.Object.AdditionalRegistrationScriptSite Do
		FillPropertyValues(Object.AdditionalRegistrationScriptSite.Add(), String);
	EndDo;
	
	// Initialize composer manually.
	ObjectDataProcessor = FormAttributeToValue("Object");
	
	Data = GetFromTempStorage(Parameters.Object.AddressLinkerAllDocuments);
	ObjectDataProcessor.ComposerAllDocumentsFilter = New DataCompositionSettingsComposer;
	ObjectDataProcessor.ComposerAllDocumentsFilter.Initialize(
		New DataCompositionAvailableSettingsSource(Data.CompositionSchema));
	ObjectDataProcessor.ComposerAllDocumentsFilter.LoadSettings(Data.Settings);
	
	ValueToFormAttribute(ObjectDataProcessor, "Object");
	
	ViewCurrentSettings = Parameters.ViewCurrentSettings;
	ReadSavedSettings();
EndProcedure

#EndRegion

#Region FormTableItemEventHandlersSettingVariants
//

&AtClient
Procedure SettingVariantsCase(Item, SelectedRow, Field, StandardProcessing)
	CurrentData = SettingVariants.FindByID(SelectedRow);
	If CurrentData<>Undefined Then
		ViewCurrentSettings = CurrentData.Presentation;
	EndIf;
EndProcedure

&AtClient
Procedure SettingsOptionsBeforeBeginAdding(Item, Cancel, Copy, Parent, Group)
	Cancel = True;
EndProcedure

&AtClient
Procedure SettingsOptionsBeforeDeleting(Item, Cancel)
	Cancel = True;
	
	SettingRepresentation = Item.CurrentData.Presentation;
	
	HeaderText = NStr("en='Confirmation';ru='Подтверждение'");
	QuestionText   = NStr("en='Delete setting ""%1""?';ru='Удалить настройку ""%1""?'");
	
	QuestionText = StrReplace(QuestionText, "%1", SettingRepresentation);
	
	AdditionalParameters = New Structure("SettingRepresentation", SettingRepresentation);
	NotifyDescription = New NotifyDescription("NotificationSettingOptionDeletionQuery", ThisObject, 
		AdditionalParameters);
	
	ShowQueryBox(NOTifyDescription, QuestionText, QuestionDialogMode.YesNo,,,HeaderText);
EndProcedure

#EndRegion

#Region FormCommandsHandlers
//

&AtClient
Procedure SaveSetting(Command)
	
	If IsBlankString(ViewCurrentSettings) Then
		CommonUseClientServer.MessageToUser(
			NStr("en='Name for the current setting is not filled.';ru='Не заполнено имя для текущей настройки.'"), , "ViewCurrentSettings");
		Return;
	EndIf;
		
	If SettingVariants.FindByValue(ViewCurrentSettings)<>Undefined Then
		HeaderText = NStr("en='Confirmation';ru='Подтверждение'");
		QuestionText   = NStr("en='Rewrite the existing setting ""%1""?';ru='Перезаписать существующую настройку ""%1""?'");
		QuestionText = StrReplace(QuestionText, "%1", ViewCurrentSettings);
		
		AdditionalParameters = New Structure("SettingRepresentation", ViewCurrentSettings);
		NotifyDescription = New NotifyDescription("NotificationSettingOptionSaveQuery", ThisObject, 
			AdditionalParameters);
			
		ShowQueryBox(NOTifyDescription, QuestionText, QuestionDialogMode.YesNo,,,HeaderText);
		Return;
	EndIf;
	
	// Save without prompts
	SaveAndExecuteCurrentSettingChoice();
EndProcedure
	
&AtClient
Procedure MakeSelection(Command)
	ExecuteCase(ViewCurrentSettings);
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions
//

&AtServer
Function ThisObject(NewObject=Undefined)
	If NewObject=Undefined Then
		Return FormAttributeToValue("Object");
	EndIf;
	ValueToFormAttribute(NewObject, "Object");
	Return Undefined;
EndFunction

&AtServer
Procedure RemoveSettingServer(SettingRepresentation)
	ThisObject().RemoveSettingsOption(SettingRepresentation);
EndProcedure

&AtServer
Procedure ReadSavedSettings()
	ThisDataProcessor = ThisObject();
	
	VariantsFilter = DataExchangeServer.InteractiveExchangeFilterOptionsExportings(Object);
	SettingVariants = ThisDataProcessor.ReadSettingsListPresentations(Object.InfobaseNode, VariantsFilter);
	
	ItemOfList = SettingVariants.FindByValue(ViewCurrentSettings);
	Items.SettingVariants.CurrentRow = ?(ItemOfList=Undefined, Undefined, ItemOfList.GetID())
EndProcedure

&AtServer
Procedure SaveCurrentSettings()
	ThisObject().SaveCurrentToSettings(ViewCurrentSettings);
EndProcedure

&AtClient
Procedure ExecuteCase(Presentation)
	If SettingVariants.FindByValue(Presentation)<>Undefined AND CloseOnChoice Then 
		NotifyChoice( New Structure("ChoiceAction, SettingRepresentation", 3, Presentation) );
	EndIf;
EndProcedure

&AtClient
Procedure NotificationSettingOptionDeletionQuery(Result, AdditionalParameters) Export
	If Result<>DialogReturnCode.Yes Then
		Return;
	EndIf;
	
	RemoveSettingServer(AdditionalParameters.SettingRepresentation);
	ReadSavedSettings();
EndProcedure

&AtClient
Procedure NotificationSettingOptionSaveQuery(Result, AdditionalParameters) Export
	If Result<>DialogReturnCode.Yes Then
		Return;
	EndIf;
	
	ViewCurrentSettings = AdditionalParameters.SettingRepresentation;
	SaveAndExecuteCurrentSettingChoice();
EndProcedure

&AtClient
Procedure SaveAndExecuteCurrentSettingChoice()
	
	SaveCurrentSettings();
	ReadSavedSettings();
	
	CloseOnChoice = True;
	ExecuteCase(ViewCurrentSettings);
EndProcedure;

#EndRegion
